In [2]:
import pandas as pd
import numpy as np

In [3]:
#who is the yongest 
# who is the oldest
# how many male and female are there 
# average age of female earning above 5000
# average men earning who are grate
df=pd.read_csv("example_csv.csv")
df

       name  age sex  salary
0     rishi   22   M   10000
1      maya   23   F   50000
2     honey   44   F   60000
3     vijay   54   M   30000
4  santhose   25   M   60000

In [4]:
a=df['age']

In [5]:
a

0    22
1    23
2    44
3    54
4    25
Name: age, dtype: int64

In [12]:
maxval=df['salary'].max()
df[df['age']==df['age'].max()]

    name  age sex  salary
3  vijay   54   M   30000

In [13]:
maxval

60000

In [14]:
minval=df['age'].min()
df[df['age']==df['age'].min()]

    name  age sex  salary
0  rishi   22   M   10000

In [15]:
minval

22

In [17]:
female= df['sex'].value_counts()['F']
female

2

In [21]:
df.groupby(['sex','salary']).salary.mean()

sex  salary
F    50000     50000.0
     60000     60000.0
M    10000     10000.0
     30000     30000.0
     60000     60000.0
Name: salary, dtype: float64

In [24]:
df[df['sex']=='F']['salary'].mean()

55000.0

In [25]:
df2 = df[df['sex']=='F']
df3 = df2[df2['salary']>50000]
df3['age'].mean()

44.0

In [26]:

# 1. Filter the data where
# Either names start from "S" or end with "y" and tell me their median age.



# 2. Let's assume this is monthly salary,
# Male - 2L by year end
# Female - 1.5L by year end
# Calculate the CTC for all these empoyees.



# 3. Based on CTC, who earns the maximum who are in their 20s.
# 4. mean CTC for male and female in their 20s.

In [31]:
# 1. Filter the data where
# Either names start from "S" or end with "y" and tell me their median age.
print(df[df['name'].str.startswith('r') & df['name'].str.endswith('i')]['age'].median())

22.0

In [37]:
# namee starting with r
df[df['name'].str.startswith('r')]

    name  age sex  salary
0  rishi   22   M   10000

In [68]:
# name ending with y 
df[df['name'].str.endswith('y')]

    name  age sex  salary     ctc      ctc2      ctc1
2  honey   44   F   60000  920000  870000.0       NaN
3  vijay   54   M   30000  560000       NaN  560000.0

In [69]:
# Based on CTC, who earns the maximum who are in their 20s
df["ctc2"]=12*df[df['sex']=='F']['salary']+150000
df["ctc1"]=12*df[df['sex']=='M']['salary']+200000

In [70]:
df

       name  age sex  salary     ctc      ctc2      ctc1
0     rishi   22   M   10000  320000       NaN  320000.0
1      maya   23   F   50000  800000  750000.0       NaN
2     honey   44   F   60000  920000  870000.0       NaN
3     vijay   54   M   30000  560000       NaN  560000.0
4  santhose   25   M   60000  920000       NaN  920000.0

In [76]:
def check_rows(row):
    return ((row['age']>20) and (row['sex'] =='M'))#use ==20 to get the age as 20
df[df.apply(check_rows,axis=1)]

       name  age sex  salary     ctc  ctc2      ctc1
0     rishi   22   M   10000  320000   NaN  320000.0
3     vijay   54   M   30000  560000   NaN  560000.0
4  santhose   25   M   60000  920000   NaN  920000.0

       name  age sex  salary     ctc
0     rishi   22   M   10000  320000
1      maya   23   F   50000  800000
2     honey   44   F   60000  920000
3     vijay   54   M   30000  560000
4  santhose   25   M   60000  920000

In [60]:
def check_rows(row):
    return ((row['age']>20) and (row['sex'] =='F'))#use ==20 to get the age as 20
df[df.apply(check_rows,axis=1)]

    name  age sex  salary     ctc
1   maya   23   F   50000  800000
2  honey   44   F   60000  920000

In [74]:
# max of ctc
df1=df[(df['age']>=20)&(df['age']<30)]
df

       name  age sex  salary     ctc      ctc2      ctc1
0     rishi   22   M   10000  320000       NaN  320000.0
1      maya   23   F   50000  800000  750000.0       NaN
2     honey   44   F   60000  920000  870000.0       NaN
3     vijay   54   M   30000  560000       NaN  560000.0
4  santhose   25   M   60000  920000       NaN  920000.0